#+title: dash.el
#+subtitle: Eispのためのモダンなリスト操作ライブラリ
#+author: conao3
#+date: <2019-04-05 金 19:08>

# history
#
# <2018-08-04 Sat 04:45> first-draft

** 概要
すべての関数はダッシュ ~-~ が前置されています。

アナフォリック版のマクロは2つのダッシュ ~--~ が前置されています。

#+begin_src emacs-lisp :exports both :results pp
  (-map (lambda (n) (* n n)) '(1 2 3 4))
#+end_src

#+RESULTS:
: (1 4 9 16)

#+begin_src emacs-lisp :exports both :results pp
  (--map (* it it) '(1 2 3 4))
#+end_src

#+RESULTS:
: (1 4 9 16)

実践的な使い方は公式の[[https://github.com/magnars/dash.el/tree/master][README]]を参照して貰えればと。

